run/icoPhaseChangeVoF/solidification2D/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     foamRun;

solver          icoPhaseChangeVoF;

startFrom       startTime;

startTime       0;

stopAt          endTime;
//stopAt          nextWrite;

endTime         1.0;

deltaT          1e-5;

writeControl    adjustableRunTime;

writeInterval   0.05;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.2;
maxAlphaCo      0.2;
maxDiCo         10000;

maxDeltaT       1e-3;


// ************************************************************************* //

DebugSwitches
{
    MULES 0;
    solidificationModel 1;
    evaporationModel 1;
}

OptimisationSwitches
{
    fileHandler collated;
}


writeFO     writeTime;

functions
{
    divU
    {
        type            div;
        libs            ("libfieldFunctionObjects.so");

        writeControl    writeTime;
        writeFields     false;
        regionType      all;
        result          divU;

        field           phi;
    }

    maxValue
    {
        type            volFieldValue;
        libs            ("libfieldFunctionObjects.so");

        log             true;
        writeControl    $writeFO;
        writeFields     false;
        regionType      all;
        cellZone        all;
        operation       max;

        fields (p_rgh T divU);
    }

    minValue
    {
        type            volFieldValue;
        libs            ("libfieldFunctionObjects.so");

        log             true;
        writeControl    $writeFO;
        writeFields     false;
        regionType      all;
        cellZone        all;
        operation       min;

        fields (p_rgh T divU);
    }

    maxMagValue
    {
        type            volFieldValue;
        libs            ("libfieldFunctionObjects.so");

        log             true;
        writeControl    $writeFO;
        writeFields     false;
        regionType      all;
        cellZone        all;
        operation       maxMag;

        fields (U);
    }
}