run/icoPhaseChangeVoF/solidification2D/constant/fvModels
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvModels;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

/*
VoFSolidificationMelting1
{
    type            VoFSolidificationMelting;

    cellZone        all;

    alphaSolidT     table
    (
        (544 1)
        (545 0)
    );

    L               0;
}
*/

//************************************************************************ //
