run/icoPhaseChangeVoF/solidification2D/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultValues
{
    alpha.bismuth 0;
};

zones
{
    metalPlate
    {
        type        box;
        zoneType    cell;
        box (-1 -1 -1) (1 0.004 1);
        values
        {
            alpha.bismuth   1;
        }
    }
};

// ************************************************************************* //